{
  "kind": "build_request",
  "title": "Fix missing chocolate rendering in teddy hands",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Correct the teddy-eating-chocolate animation so the chocolate bar is clearly visible inside/between the teddy’s hands (not missing/hidden) throughout the early phases, while keeping the rest of the animation and visuals unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "The chocolate inside the hands of the teddy is just missing. Please just correct that everything else is perfect"
        ]
      },
      "acceptanceCriteria": [
        "On the Surprise view, the chocolate bar is visibly rendered in the teddy’s hands during the idle/anticipation portion of the animation (i.e., not off-screen and not occluded behind the teddy).",
        "During the bite/chew phases, the chocolate continues to render and animate without disappearing due to layering (z-index) issues.",
        "No other animation phases, overlays (speed lines/sparkles/crumbs), audio timing, or UI elements are changed beyond what is necessary to make the chocolate visible in the teddy’s hands."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any immutable hook paths listed in SYSTEM_CONTEXT.",
    "Do not add backend changes for this fix; the issue is purely in the frontend animation rendering."
  ],
  "nonGoals": [
    "Do not redesign or retime the animation sequence beyond adjustments required to correctly render the chocolate in the teddy’s hands.",
    "Do not add new sound effects or new UI controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}